IDEA Open Model
ConcreteCheckResult Class
Compatible with IDEA StatiCa 20.1
 Concrete Check results
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResult
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConcreteCheckResult
Public Class ConcreteCheckResult
The ConcreteCheckResult type exposes the following members.
Constructors
Name | Description
ConcreteCheckResult
 Constructor
Top
Properties
Name | Description
CheckResults
 All results - first is extreme
ResultType
 Check result type
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace